In [23]:
import pandas as pd
from sqlalchemy import create_engine

In [24]:
df = pd.read_csv('tips.csv')
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [29]:
df = df[['total_bill','sex']]

In [30]:
df

     total_bill     sex
0         16.99  Female
1         10.34    Male
2         21.01    Male
3         23.68    Male
4         24.59  Female
..          ...     ...
239       29.03    Male
240       27.18  Female
241       22.67    Male
242       17.82    Male
243       18.78  Female

[244 rows x 2 columns]

In [25]:
user = 'root'
password ='Shreyas*7'
host='localhost'
database='db2'
connection = f'mysql+mysqlconnector://{user}:{password}@{host}/{database}'

In [26]:
connection

'mysql+mysqlconnector://root:Shreyas*7@localhost/db2'

In [27]:
engine = create_engine(connection)

In [28]:
df.to_sql('tips_table',con=engine,if_exists='replace',index=False)

244

In [31]:
import mysql.connector

In [32]:
db = mysql.connector.connect(user='root',
                            password='Shreyas*7',
                            host='localhost',
                            database='db2')
cursor = db.cursor()

In [35]:
cursor.execute(""" CREATE TABLE IF NOT EXISTS tips_table2 (
total_bill FLOAT,
sex VARCHAR(10)

);""")

In [36]:
db.commit()

In [46]:
insert_query = """ INSERT INTO tips_table2 (total_bill,sex)
VALUES(%s,%s)"""

In [47]:
#prepare the data as a list of tuples

data_to_insert = [tuple(d) for d in df.values]

In [48]:
cursor.executemany(insert_query,data_to_insert)
db.commit()

In [49]:
#close the connection

#cursor.close()
#db.close()